% ばねマスダンパ系にアクチュエータを加えたシミュレーション
clear;
clc;
close all;

% パラメータ設定
m1 = 1;      % 質点の質量 [kg]
k1 = 10;     % ばね定数 [N/m]
c1 = 1;    % ダンパ定数 [N/(m/s)]
m2 = 5;      % 質点の質量 [kg]
k2 = 20;     % ばね定数 [N/m]
c2 = 2;    % ダンパ定数 [N/(m/s)]

%　制御ゲイン設定
f1 = 60;
f2 = 30;

% 初期条件
x1 = 1;     % 初期変位 [m]
v1 = 0;     % 初期速度 [m/s]
x2 = 2;     % 初期変位 [m]
v2 = 0;     % 初期速度 [m/s]

% 目標行列
r = [0 0 0 0]';

% シミュレーション時間
Tf = 30;
dt = 0.01;   

% シミュレーション条件
control_on = true;

% 運動方程式の数値解法
sim("P_spring_2mass_damper_system.slx");

%結果のプロット
run("plot_2mass.m")
